Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: قال إنما أوتيته على علم عندي أولم يعلم أن الله قد أهلك من قبله من القرون من هو أشد منه قوة وأكثر جمعا ولا يسأل عن ذنوبهم المجرمون
en: He said: "This has been given to me only because of the knowledge I possess." Did he not know that Allah had destroyed before him generations, men who were stronger than him in might and greater in the amount (of riches) they had collected? But the Mujrimun (criminals, disbelievers, polytheists, sinners) will not be questioned of their sins (because Allah knows them well, so they will be punished without being called to account).

source: فخرج على قومه في زينته قال الذين يريدون الحياة الدنيا يا ليت لنا مثل ما أوتي قارون إنه لذو حظ عظيم
en: So he went forth before his people in his pomp. Those who were desirous of the life of the world, said: "Ah, would that we had the like of what Qarun (Korah) has been given! Verily he is the owner of a great fortune."

source: وقال الذين أوتوا العلم ويلكم ثواب الله خير لمن آمن وعمل صالحا ولا يلقاها إلا الصابرون
en: But those who had been given (religious) knowledge said: "Woe to you! The Reward of Allah (in the Hereafter) is better for those who believe and do righteous good deeds, and this none shall attain except those who are As-Sabirun (the patient in following the truth)."

source: فخسفنا به وبداره الأرض فما كان له من فئة ينصرونه من دون الله وما كان من المنتصرين
en: So We caused the earth to swallow him and his dwelling place. Then he had no group or party to help him against Allah, nor was he one of those who could save themselves.

source: وأصبح الذين تمنوا مكانه بالأمس يقولون ويكأن الله يبسط الرزق لمن يشاء من عباده ويقدر لولا أن من الله علينا لخسف بنا ويكأنه لا يفلح الكافرون
en: And those who had desired (for a position like) his position the day before, began to say: "Know you not that it is Allah Who enlarges the provision or restricts it to whomsoever He pleases of His slaves. Had it not been that Allah was Gracious to us, He could have caused the earth to swallow us up (also)! Know you not that the disbelievers will never be successful.

source: تلك الدار الآخرة نجعلها للذين لا يريدون علوا في الأرض ولا فسادا والعاقبة للمتقين
en: That home of the Hereafter (i.e. Paradise), We shall assign to those who rebel not against the truth with pride and oppression in the land nor do mischief by committing crimes. And the good end is for the Muttaqun (the pious - See V.2:2).

source: من جاء بالحسنة فله خير منها ومن جاء بالسيئة فلا يجزى الذين عملوا السيئات إلا ما كانوا يعملون
en: Whosoever brings good (Islamic Monotheism along with righteous deeds), he shall have the better thereof; and whosoever brings evil (polytheism along with evil deeds), then those who do evil deeds will only be requited for what they used to do.

source: إن الذي فرض عليك القرآن لرادك إلى معاد قل ربي أعلم من جاء بالهدى ومن هو في ضلال مبين
en: Verily, He Who has given you (O Muhammad صلى الله عليه وسلم) the Qur'an (i.e. ordered you to act on its laws and to preach it to others) will surely bring you back to Ma'ad (place of return, either to Makkah or to Paradise after your death). Say (O Muhammad صلى الله عليه وسلم): "My Lord is Aware of him who brings guidance, and of him who is in manifest error."

source: وما كنت ترجو أن يلقى إليك الكتاب إلا رحمة من ربك فلا تكونن ظهيرا للكافرين
en: And you were not expecting that the Book (this Qur'an) would be sent down to you, but it is a mercy from your Lord. So never be a supporter of the disbelievers.

source: ولا يصدنك عن آيات الله بعد إذ أنزلت إليك وادع إلى ربك ولا تكونن من المشركين
en: And let them not turn you (O Muhammad صلى الله عليه وسلم) away from (preaching) the Ayat (revelations and verses) of Allah after they have been sent down to you: and invite (men) to (believe in) your Lord and be not of Al-Mushrikun (those who associate partners with Allah, e.g. polytheists, pagans, idolaters, and those who disbelieve in the Oneness of Allah and deny the Prophethood of Messenger Muhammad صلى الله عليه وسلم).

source: ولا تدع مع الله إلها آخر لا إله إلا هو كل شيء هالك إلا وجهه له الحكم وإليه ترجعون
en: And invoke not any other ilah (god) along with Allah: La ilaha illa Huwa (none has the right to be worshipped but He). Everything will perish save His Face. His is the Decision, and to Him you (all) shall be returned.

source: أحسب الناس أن يتركوا أن يقولوا آمنا وهم لا يفتنون
en: Do people think that they will be left alone because they say: "We believe," and will not be tested.

source: ولقد فتنا الذين من قبلهم فليعلمن الله الذين صدقوا وليعلمن الكاذبين
en: And We indeed tested those who were before them. And Allah will certainly make (it) known (the truth of) those who are true, and will certainly make (it) known (the falsehood of) those who are liars, (although Allah knows all that before putting them to test).

source: أم حسب الذين يعملون السيئات أن يسبقونا ساء ما يحكمون
en: Or think those who do evil deeds that they can outstrip Us (i.e. escape Our punishment)? Evil is that which they judge!

source: من كان يرجو لقاء الله فإن أجل الله لآت وهو السميع العليم
en: Whoever hopes for the Meeting with Allah, then Allah's Term is surely coming and He is the All-Hearer, the All-Knower.

source: ومن جاهد فإنما يجاهد لنفسه إن الله لغني عن العالمين
en: And whosoever strives, he strives only for himself. Verily, Allah stands not in need of any of the 'Alamin (mankind, jinn, and all that exists).

source: والذين آمنوا وعملوا الصالحات لنكفرن عنهم سيئاتهم ولنجزينهم أحسن الذي كانوا يعملون
en: Those who believe [in the Oneness of Allah (Monotheism) and in Messenger Muhammad صلى الله عليه وسلم , and do not give up their faith because of the harm they receive from the polytheists], and do righteous good deeds, surely, We shall expiate from them their evil deeds and shall reward them according to the best of that which they used to do.

source: ووصينا الإنسان بوالديه حسنا وإن جاهداك لتشرك بي ما ليس لك به علم فلا تطعهما إلي مرجعكم فأنبئكم بما كنتم تعملون
en: And We have enjoined on man to be good and dutiful to his parents; but if they strive to make you join with Me (in worship) anything (as a partner) of which you have no knowledge, then obey them not. Unto Me is your return and I shall tell you what you used to do.

source: والذين آمنوا وعملوا الصالحات لندخلنهم في الصالحين
en: And for those who believe (in the Oneness of Allah and the other articles of Faith) and do righteous good deeds, surely, We shall make them enter with (in the entrance of) the righteous (in Paradise).

source: ومن الناس من يقول آمنا بالله فإذا أوذي في الله جعل فتنة الناس كعذاب الله ولئن جاء نصر من ربك ليقولن إنا كنا معكم أوليس الله بأعلم بما في صدور العالمين
en: Of mankind are some who say: "We believe in Allah." But if they are made to suffer for the sake of Allah, they consider the trial of mankind as Allah's punishment; and if victory comes from your Lord, (the hypocrites) will say: "Verily we were with you (helping you)." Is not Allah Best Aware of what is in the breasts of the 'Alamin (mankind and jinn).

source: وليعلمن الله الذين آمنوا وليعلمن المنافقين
en: Verily, Allah knows those who believe, and verily, He knows the hypocrites [i.e. Allah will test the people with good and hard days to discriminate the good from the wicked, although Allah knows all that before putting them to test].

source: وقال الذين كفروا للذين آمنوا اتبعوا سبيلنا ولنحمل خطاياكم وما هم بحاملين من خطاياهم من شيء إنهم لكاذبون
en: And those who disbelieve say to those who believe: "Follow our way and we will verily bear your sins." Never will they bear anything of their sins. Surely, they are liars.

source: وليحملن أثقالهم وأثقالا مع أثقالهم وليسألن يوم القيامة عما كانوا يفترون
en: And verily, they shall bear their own loads, and other loads besides their own; and verily, they shall be questioned on the Day of Resurrection about that which they used to fabricate.

source: ولقد أرسلنا نوحا إلى قومه فلبث فيهم ألف سنة إلا خمسين عاما فأخذهم الطوفان وهم ظالمون
en: And indeed We sent Nuh (Noah) to his people, and he stayed among them a thousand years less fifty years [inviting them to believe in the Oneness of Allah (Monotheism), and discard the false gods and other deities]; and the Deluge overtook them while they were Zalimun (wrong-doers, polytheists, disbelievers).

source: فأنجيناه وأصحاب السفينة وجعلناها آية للعالمين
en: Then We saved him and those with him in the ship, and made it (the ship) an Ayah (a lesson, a warning) for the 'Alamin (mankind, jinn and all that exists).

source: وإبراهيم إذ قال لقومه اعبدوا الله واتقوه ذلكم خير لكم إن كنتم تعلمون
en: And (remember) Ibrahim (Abraham) when he said to his people: "Worship Allah (Alone), and fear Him: that is better for you if you did but know.

source: إنما تعبدون من دون الله أوثانا وتخلقون إفكا إن الذين تعبدون من دون الله لا يملكون لكم رزقا فابتغوا عند الله الرزق واعبدوه واشكروا له إليه ترجعون
en: "You worship besides Allah only idols, and you only invent falsehood. Verily, those whom you worship besides Allah have no power to give you provision: so seek your provision from Allah (Alone), and worship Him (Alone), and be grateful to Him. To Him (Alone) you will be brought back.

source: وإن تكذبوا فقد كذب أمم من قبلكم وما على الرسول إلا البلاغ المبين
en: "And if you deny, then nations before you have denied (their Messengers). And the duty of the Messenger is only to convey (the Message) plainly."

source: أولم يروا كيف يبدئ الله الخلق ثم يعيده إن ذلك على الله يسير
en: See they not how Allah originates the creation, then repeats it. Verily, that is easy for Allah.

source: قل سيروا في الأرض فانظروا كيف بدأ الخلق ثم الله ينشئ النشأة الآخرة إن الله على كل شيء قدير
en: Say: "Travel in the land and see how (Allah) originated the creation, and then Allah will bring forth the creation of the Hereafter (i.e. resurrection after death). Verily, Allah is Able to do all things."

source: يعذب من يشاء ويرحم من يشاء وإليه تقلبون
en: He punishes whom He wills, and shows mercy to whom He wills; and to Him you will be returned.

source: وما أنتم بمعجزين في الأرض ولا في السماء وما لكم من دون الله من ولي ولا نصير
en: And you cannot escape in the earth or in the heaven (from Allah). And besides Allah you have neither any Wali (Protector or Guardian) nor any Helper.

source: والذين كفروا بآيات الله ولقائه أولئك يئسوا من رحمتي وأولئك لهم عذاب أليم
en: And those who disbelieve in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah and the Meeting with Him, it is they who have no hope of My Mercy: and it is they who will have a painful torment.

source: فما كان جواب قومه إلا أن قالوا اقتلوه أو حرقوه فأنجاه الله من النار إن في ذلك لآيات لقوم يؤمنون
en: So nothing was the answer of [Ibrahim's (Abraham)] people except that they said: "Kill him or burn him." Then Allah saved him from the fire. Verily, in this are indeed signs for a people who believe.

source: وقال إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين
en: And [Ibrahim (Abraham)] said: "You have taken (for worship) idols instead of Allah. The love between you is only in the life of this world, but on the Day of Resurrection, you shall disown each other, and curse each other, and your abode will be the Fire, and you shall have no helper."

source: فآمن له لوط وقال إني مهاجر إلى ربي إنه هو العزيز الحكيم
en: So Lut (Lot) believed in him [Ibrahim's (Abraham) Message of Islamic Monotheism]. He [Ibrahim (Abraham)] said: "I will emigrate for the sake of my Lord. Verily, He is the All-Mighty, the All-Wise. "

source: ووهبنا له إسحاق ويعقوب وجعلنا في ذريته النبوة والكتاب وآتيناه أجره في الدنيا وإنه في الآخرة لمن الصالحين
en: And We bestowed on him [Ibrahim (Abraham)], Ishaq (Isaac) and Ya'qub (Jacob), and We ordained among his offspring Prophethood and the Book [i.e. the Taurat (Torah) (to Musa - Moses), the Injeel (Gospel) (to 'Îsa - Jesus), and the Qur'an (to Muhammad صلى الله عليه وسلم), all from the offspring of Ibrahim (Abraham)], and We granted him his reward in this world; and verily, in the Hereafter he is indeed among the righteous.

source: ولوطا إذ قال لقومه إنكم لتأتون الفاحشة ما سبقكم بها من أحد من العالمين
en: And (remember) Lut (Lot), when he said to his people: "You commit Al-Fahishah (sodomy - the worst sin) which none has preceded you in (committing) it in the 'Alamin (mankind and jinn)."

source: أئنكم لتأتون الرجال وتقطعون السبيل وتأتون في ناديكم المنكر فما كان جواب قومه إلا أن قالوا ائتنا بعذاب الله إن كنت من الصادقين
en: "Verily, you practise sodomy with men, and rob the wayfarer (travellers)! And practise Al-Munkar (disbelief and polytheism and every kind of evil wicked deed) in your meetings." But his people gave no answer except that they said: "Bring Allah's Torment upon us if you are one of the truthful."

source: قال رب انصرني على القوم المفسدين
en: He said: "My Lord! Give me victory over the people who are Mufsidun (those who commit great crimes and sins, oppressors, tyrants, mischief-makers, corrupters).

source: ولما جاءت رسلنا إبراهيم بالبشرى قالوا إنا مهلكو أهل هذه القرية إن أهلها كانوا ظالمين
en: And when Our Messengers came to Ibrahim (Abraham) with the glad tidings they said: "Verily, we are going to destroy the people of this [Lut (Lot's)] town (i.e. the town of Sodom in Palestine); truly, its people have been Zalimun [wrong-doers, polytheists disobedient to Allah, and who belied their Messenger Lut (Lot)]."

source: قال إن فيها لوطا قالوا نحن أعلم بمن فيها لننجينه وأهله إلا امرأته كانت من الغابرين
en: Ibrahim (Abraham) said: "But there is Lut (Lot) in it." They said: "We know better who is there. We will verily save him [Lut (Lot)] and his family except his wife: she will be of those who remain behind (i.e. she will be destroyed along with those who will be destroyed from her folk)."

source: ولما أن جاءت رسلنا لوطا سيء بهم وضاق بهم ذرعا وقالوا لا تخف ولا تحزن إنا منجوك وأهلك إلا امرأتك كانت من الغابرين
en: And when Our Messengers came to Lut (Lot), he was grieved because of them, and felt straitened on their account. They said: "Have no fear, and do not grieve! Truly, we shall save you and your family, except your wife: she will be of those who remain behind (i.e. she will be destroyed along with those who will be destroyed from her folk).

source: إنا منزلون على أهل هذه القرية رجزا من السماء بما كانوا يفسقون
en: "Verily, we are about to bring down on the people of this town a great torment from the sky, because they have been rebellious (against Allah's Command)."

source: ولقد تركنا منها آية بينة لقوم يعقلون
en: And indeed We have left thereof an evident Ayah (a lesson and a warning and a sign - the place where the Dead Sea is now in Palestine) for a folk who understand.

source: وإلى مدين أخاهم شعيبا فقال يا قوم اعبدوا الله وارجوا اليوم الآخر ولا تعثوا في الأرض مفسدين
en: And to (the people of) Madyan (Midian), We sent their brother Shu'aib. He said: "O my people! Worship Allah (Alone) and hope for (the reward of good deeds by worshipping Allah Alone, on) the last Day (i.e. the Day of Resurrection), and commit no mischief on the earth as Mufsidun (those who commit great crimes, oppressors, tyrants, mischief-makers, corrupters). [Tafsir At-Tabari]

source: فكذبوه فأخذتهم الرجفة فأصبحوا في دارهم جاثمين
en: And they belied him [Shu'aib]: so the earthquake seized them, and they lay (dead), prostrate in their dwellings.

source: وعادا وثمود وقد تبين لكم من مساكنهم وزين لهم الشيطان أعمالهم فصدهم عن السبيل وكانوا مستبصرين
en: And 'Ad and Thamud (people)! And indeed (their destruction) is clearly apparent to you from their (ruined) dwellings. Shaitan (Satan) made their deeds fair-seeming to them, and turned them away from the (Right) Path, though they were intelligent.

source: وقارون وفرعون وهامان ولقد جاءهم موسى بالبينات فاستكبروا في الأرض وما كانوا سابقين
en: And (We destroyed also) Qarun (Korah), Fir'aun (Pharaoh), and Haman. And indeed Musa (Moses) came to them with clear Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), but they were arrogant in the land, yet they could not outstrip Us (escape Our punishment).

source: فكلا أخذنا بذنبه فمنهم من أرسلنا عليه حاصبا ومنهم من أخذته الصيحة ومنهم من خسفنا به الأرض ومنهم من أغرقنا وما كان الله ليظلمهم ولكن كانوا أنفسهم يظلمون
en: So We punished each (of them) for his sins; of them were some on whom We sent Hasib (a violent wind with shower of stones) [as on the people of Lut (Lot)], and of them were some who were overtaken by As-Saihah [torment - awful cry. (as Thamud or Shu'aib's people)], and of them were some whom We caused the earth to swallow [as Qarun (Korah)], and of them were some whom We drowned [as the people of Nuh (Noah), or Fir'aun (Pharaoh) and his people]. It was not Allah Who wronged them, but they wronged themselves.

source: مثل الذين اتخذوا من دون الله أولياء كمثل العنكبوت اتخذت بيتا وإن أوهن البيوت لبيت العنكبوت لو كانوا يعلمون
en: The likeness of those who take (false deities as) Auliya' (protectors, helpers) other than Allah is the likeness of a spider who builds (for itself) a house; but verily, the frailest (weakest) of houses is the spider's house - if they but knew.

source: إن الله يعلم ما يدعون من دونه من شيء وهو العزيز الحكيم
en: Verily, Allah knows what things they invoke instead of Him. He is the All-Mighty, the All-Wise.

source: وتلك الأمثال نضربها للناس وما يعقلها إلا العالمون
en: And these similitudes We put forward for mankind; but none will understand them except those who have knowledge (of Allah and His Signs).

source: خلق الله السماوات والأرض بالحق إن في ذلك لآية للمؤمنين
en: (Allah says to His Prophet Muhammad صلى الله عليه وسلم): "Allah (Alone) created the heavens and the earth with truth (and none shared Him in their creation)." Verily! Therein is surely a sign for those who believe.

source: اتل ما أوحي إليك من الكتاب وأقم الصلاة إن الصلاة تنهى عن الفحشاء والمنكر ولذكر الله أكبر والله يعلم ما تصنعون
en: Recite (O Muhammad صلى الله عليه وسلم) what has been revealed to you of the Book (the Qur'an), and perform As-Salat (Iqamat-as-Salat). Verily, As-Salat (the prayer) prevents from Al-Fahsha' (i.e. great sins of every kind, unlawful sexual intercourse) and Al-Munkar (i.e. disbelief, polytheism, and every kind of evil wicked deed) and the remembering (praising) of (you by) Allah (in front of the angels) is greater indeed [than your remembering (praising) of Allah in prayers. And Allah knows what you do.

source: ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن إلا الذين ظلموا منهم وقولوا آمنا بالذي أنزل إلينا وأنزل إليكم وإلهنا وإلهكم واحد ونحن له مسلمون
en: And argue not with the people of the Scripture (Jews and Christians), unless it be in (a way) that is better (with good words and in good manner, inviting them to Islamic Monotheism with His Verses), except with such of them as do wrong; and say (to them): "We believe in that which has been revealed to us and revealed to you; our Ilah (God) and your Ilah (God) is One (i.e. Allah), and to Him we have submitted (as Muslims)."

source: وكذلك أنزلنا إليك الكتاب فالذين آتيناهم الكتاب يؤمنون به ومن هؤلاء من يؤمن به وما يجحد بآياتنا إلا الكافرون
en: And thus We have sent down the Book (i.e. this Qur'an) to you (O Muhammad صلى الله عليه وسلم), and those whom We gave the Scripture [the Taurat (Torah) and the Injeel (Gospel) aforetime] believe therein as also do some of these (who are present with you now like 'Abdullah bin Salam) and none but the disbelievers reject Our Ayat [(proofs, signs, verses, lessons, etc.,) and deny Our Oneness of Lordship and Our Oneness of worship and Our Oneness of Our Names and Qualities: i.e. Islamic Monotheism].

source: وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك إذا لارتاب المبطلون
en: Neither did you (O Muhammad صلى الله عليه وسلم) read any book before it (this Qur'an), nor did you write any book (whatsoever) with your right hand. In that case, indeed, the followers of falsehood might have doubted.

source: بل هو آيات بينات في صدور الذين أوتوا العلم وما يجحد بآياتنا إلا الظالمون
en: Nay, but they, the clear Ayat [i.e. the description and the qualities of Prophet Muhammad صلى الله عليه وسلم written in the Taurat (Torah) and the Injeel (Gospel)] are preserved in the breasts of those who have been given knowledge (among the people of the Scriptures). And none but the Zalimun (polytheists and wrongdoers) deny Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.).

source: وقالوا لولا أنزل عليه آيات من ربه قل إنما الآيات عند الله وإنما أنا نذير مبين
en: And they say: "Why are not signs sent down to him from his Lord? Say: "The signs are only with Allah, and I am only a plain warner."

source: أولم يكفهم أنا أنزلنا عليك الكتاب يتلى عليهم إن في ذلك لرحمة وذكرى لقوم يؤمنون
en: Is it not sufficient for them that We have sent down to you the Book (the Qur'an) which is recited to them? Verily, herein is mercy and a reminder (or an admonition) for a people who believe .

source: قل كفى بالله بيني وبينكم شهيدا يعلم ما في السماوات والأرض والذين آمنوا بالباطل وكفروا بالله أولئك هم الخاسرون
en: Say (to them O Muhammad صلى الله عليه وسلم): "Sufficient is Allah for a witness between me and you. He knows what is in the heavens and on earth." And those who believe in Batil (all false deities other than Allah), and disbelieve in Allah and (in His Oneness), it is they who are the losers.

source: ويستعجلونك بالعذاب ولولا أجل مسمى لجاءهم العذاب وليأتينهم بغتة وهم لا يشعرون
en: And they ask you to hasten on the torment (for them): and had it not been for a term appointed, the torment would certainly have come to them. And surely, it will come upon them suddenly while they perceive not!

source: يستعجلونك بالعذاب وإن جهنم لمحيطة بالكافرين
en: They ask you to hasten on the torment. And verily, Hell, of a surety, will encompass the disbelievers.

source: يوم يغشاهم العذاب من فوقهم ومن تحت أرجلهم ويقول ذوقوا ما كنتم تعملون
en: On the Day when the torment (Hell-fire) shall cover them from above them and from underneath their feet, and it will be said: "Taste what you used to do."

source: يا عبادي الذين آمنوا إن أرضي واسعة فإياي فاعبدون
en: O My slaves who believe! Certainly, spacious is My earth. Therefore worship Me." (Alone) .

source: كل نفس ذائقة الموت ثم إلينا ترجعون
en: Everyone shall taste death. Then unto Us you shall be returned.

source: والذين آمنوا وعملوا الصالحات لنبوئنهم من الجنة غرفا تجري من تحتها الأنهار خالدين فيها نعم أجر العاملين
en: And those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, to them We shall surely give lofty dwellings in Paradise, underneath which rivers flow, to live therein forever. Excellent is the reward for the workers.

source: وكأين من دابة لا تحمل رزقها الله يرزقها وإياكم وهو السميع العليم
en: And so many a moving (living) creature carries not its own provision! Allah provides for it and for you. And He is the All-Hearer, the All-Knower.

source: ولئن سألتهم من خلق السماوات والأرض وسخر الشمس والقمر ليقولن الله فأنى يؤفكون
en: And if you were to ask them: "Who has created the heavens and the earth and subjected the sun and the moon?" they will surely reply: "Allah." How then are they deviating (as polytheists and disbelievers)?

source: الله يبسط الرزق لمن يشاء من عباده ويقدر له إن الله بكل شيء عليم
en: Allah enlarges the provision for whom He wills of His slaves, and straitens it for whom (He wills). Verily, Allah is the All-Knower of everything.

source: ولئن سألتهم من نزل من السماء ماء فأحيا به الأرض من بعد موتها ليقولن الله قل الحمد لله بل أكثرهم لا يعقلون
en: And if you were to ask them: "Who sends down water (rain) from the sky, and gives life therewith to the earth after its death?" they will surely reply: "Allah." Say: "All the praises and thanks be to Allah!" Nay, most of them have no sense.
